Read the raw files first

In [376]:
import pandas as pd
pd.set_option("display.max_columns", 85)
movies_df = pd.read_csv("data/movies_metadata.csv")
credits_df = pd.read_csv("data/credits.csv")
keywords_df = pd.read_csv("data/keywords.csv")
links_sm_df = pd.read_csv("data/links_small.csv")
links_df = pd.read_csv("data/links.csv")
ratings_sm_df = pd.read_csv("data/ratings_small.csv")
ratings_df = pd.read_csv("data/ratings.csv")
tmdb_credits_df = pd.read_csv("data/tmdb_5000_credits.csv")
tmdb_movies_df = pd.read_csv("data/tmdb_5000_movies.csv")

/var/folders/nq/ln_gwthx2kb0qfqrxc4zszmr0000gn/T/ipykernel_87228/782814067.py:3: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  movies_df = pd.read_csv("data/movies_metadata.csv")

### Data cleanup: 
- movies_df
    - reformat ['imdb_id']: remove leading 'tt0' from string.
    - make id the index

In [291]:
# strip 'tt0' from the column  
movies_df['imdb_id'].str.strip('tt0')
movies_df['imdb_id']

0        tt0114709
1        tt0113497
2        tt0113228
3        tt0114885
4        tt0113041
           ...
45461    tt6209470
45462    tt2028550
45463    tt0303758
45464    tt0008536
45465    tt6980792
Name: imdb_id, Length: 45466, dtype: object

- links_df
    - drop na
    - update ['tmdbId'] to remove the decimal and convert to str
    - rename ['movieId'] to ['movie_id']
    - rename ['imdbId'] to ['imdb_id']
    - rename ['tmdbId'] to ['id']

In [405]:
print(links_df.shape)
links_df.head()

(45843, 3)

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [407]:
# drop na when tmdbId is null
links_df.dropna(axis='index', how='all', subset=['tmdbId'], inplace=True)
print(links_df.shape)

# remove the decimal in tmdbId column and update dtype to string
links_df['tmdbId'] = links_df['tmdbId'].astype(str).apply(lambda x: x.replace('.0',''))


# update column name to be consistent with movies_df
links_df.rename(columns={"movieId" : "movie_id", "imdbId": "imdb_id", "tmdbId": "id"}, inplace=True)
links_df

(45624, 3)

       movie_id  imdb_id      id
0             1   114709     862
1             2   113497    8844
2             3   113228   15602
3             4   114885   31357
4             5   113041   11862
...         ...      ...     ...
45838    176269  6209470  439050
45839    176271  2028550  111109
45840    176273   303758   67758
45841    176275     8536  227506
45842    176279  6980792  461257

[45624 rows x 3 columns]

In [361]:
#convert all to id fields to string
links_df['movie_id'] = links_df['movie_id'].astype(str)
links_df['imdb_id'] = links_df['imdb_id'].astype(str)
links_df['id'] = links_df['id'].astype(str)
links_df.dtypes

movie_id    object
imdb_id     object
id          object
dtype: object

- links_sm_df
    - drop na if no value in ['tmdbId']
    - update ['tmdbId'] to remove the decimal and convert to str
    - rename ['movieId'] to ['movie_id']
    - rename ['imdbId'] to ['imdb_id']
    - rename ['tmdbId'] to ['id']
    - convert all ID fields to string

In [408]:
# drop na if no value in ['tmdbId']
links_sm_df.dropna(axis='index', how='all', subset=['tmdbId'], inplace=True)

# remove the decimal in tmdbId column and update dtype to string
links_sm_df['tmdbId'] = links_sm_df['tmdbId'].astype(str).apply(lambda x: x.replace('.0',''))
links_sm_df['tmdbId']

# update column name to be consistent with movies_df
links_sm_df.rename(columns={"movieId" : "movie_id", "imdbId": "imdb_id", "tmdbId": "id"}, inplace=True)
links_sm_df

      movie_id  imdb_id      id
0            1   114709     862
1            2   113497    8844
2            3   113228   15602
3            4   114885   31357
4            5   113041   11862
...        ...      ...     ...
9120    162672  3859980  402672
9121    163056  4262980  315011
9122    163949  2531318  391698
9123    164977    27660  137608
9124    164979  3447228  410803

[9112 rows x 3 columns]

In [409]:
#convert all to id fields to string
links_sm_df['movie_id'] = links_sm_df['movie_id'].astype(str)
links_sm_df['imdb_id'] = links_sm_df['imdb_id'].astype(str)
links_sm_df.dtypes

movie_id    object
imdb_id     object
id          object
dtype: object

2009-12-14 02:52:59

- tmdb_credits_df
    - update update ['movie_id'] to string
    - update ['movie_id'] to ['id']

In [414]:
#update ['movie_id'] to string
tmdb_credits_df['movie_id'] = tmdb_credits_df['movie_id'].astype(str)

#update ['movie_id'] to ['id']
tmdb_credits_df.rename(columns={"movie_id" : "id"}, inplace=True)
tmdb_credits_df

KeyError: 'movie_id'

- tmdb_movies_df
    - update ['id'] from int to str

In [412]:
# update ['id'] from int to str
tmdb_movies_df.id = tmdb_movies_df.id.astype(str)
tmdb_movies_df.id.dtype

dtype('O')

- keywords_df
    - update ['id'] from int to str

In [416]:
# update ['id'] from int to str
keywords_df.id = keywords_df.id.astype(str)
keywords_df.id.dtype

dtype('O')

- credits_df
    - update ['id'] from int to str

In [417]:
# update ['id'] from int to str
credits_df.id = credits_df.id.astype(str)
credits_df.id.dtype

dtype('O')

- ratings_df
    - rename ['userId] to ['user_id']
    - rename ['movieId] to ['movie_id']
    - convert ['user_id'] and ['movie_id'] to string
    - convert unix timestamp to python timestamp

In [378]:
ratings_df

          userId  movieId  rating   timestamp
0              1      110     1.0  1425941529
1              1      147     4.5  1425942435
2              1      858     5.0  1425941523
3              1     1221     5.0  1425941546
4              1     1246     5.0  1425941556
...          ...      ...     ...         ...
26024284  270896    58559     5.0  1257031564
26024285  270896    60069     5.0  1257032032
26024286  270896    63082     4.5  1257031764
26024287  270896    64957     4.5  1257033990
26024288  270896    71878     2.0  1257031858

[26024289 rows x 4 columns]

In [380]:

##convert to string 
ratings_df['movieId'] = ratings_df['movieId'].astype(str)
ratings_df.userId = ratings_df.userId.astype(str)
ratings_df.userId

#rename columns
ratings_df.rename(columns={"userId" : "user_id", "movieId" : "movie_id"}, inplace=True)
ratings_df.dtypes

user_id       object
movie_id      object
rating       float64
timestamp      int64
dtype: object

In [388]:
# convert unix time 
import datetime
ratings_df['timestamp'] = pd.to_datetime(ratings_df['timestamp'], unit = 's')
ratings_df['timestamp']

0          2015-03-09 22:52:09
1          2015-03-09 23:07:15
2          2015-03-09 22:52:03
3          2015-03-09 22:52:26
4          2015-03-09 22:52:36
                   ...
26024284   2009-10-31 23:26:04
26024285   2009-10-31 23:33:52
26024286   2009-10-31 23:29:24
26024287   2009-11-01 00:06:30
26024288   2009-10-31 23:30:58
Name: timestamp, Length: 26024289, dtype: datetime64[ns]

- ratings_sm_df
    - rename ['userId] to ['user_id']
    - rename ['movieId] to ['movie_id']
    - convert ['user_id'] and ['movie_id'] to string
    - convert unix timestamp to python timestamp

In [389]:
ratings_sm_df.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [390]:
ratings_sm_df.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object

In [395]:
##convert to string 
ratings_sm_df['movieId'] = ratings_sm_df['movieId'].astype(str)
ratings_sm_df.userId = ratings_sm_df.userId.astype(str)
ratings_sm_df.dtypes

#rename columns
ratings_sm_df.rename(columns={"userId" : "user_id", "movieId" : "movie_id"}, inplace=True)
ratings_sm_df.dtypes

user_id       object
movie_id      object
rating       float64
timestamp      int64
dtype: object

In [396]:
# convert unix time 
import datetime
ratings_sm_df['timestamp'] = pd.to_datetime(ratings_sm_df['timestamp'], unit = 's')
ratings_sm_df['timestamp']

0        2009-12-14 02:52:24
1        2009-12-14 02:52:59
2        2009-12-14 02:53:02
3        2009-12-14 02:53:05
4        2009-12-14 02:53:25
                 ...
99999    2003-10-08 02:16:10
100000   2003-10-03 02:46:41
100001   2003-12-09 03:26:03
100002   2003-12-09 14:21:03
100003   2004-01-22 15:18:44
Name: timestamp, Length: 100004, dtype: datetime64[ns]